"""
Python does note have a switch like syntax hence we can
use context manager (inform of a class) to replicate a switch- case statement
"""
from model.weather_status import WeatherType


class CustomSwitch:
    def __init__(self, value):
        self._val = value

    def __enter__(self):
        return self

    def __exit__(self, type, value, traceback):
        return False
    """
    Meat of the class since the value is stored
    we get the condition needed to be fullfiled in order
    to retrieve the value
    if the condition is satisfied we give out the stored value
    """

    def __call__(self, cond, *args):
        return self._val in (cond, )+args


def weather_status_switch(value):
    cloudy = """
    \033[38;5;250m     .--. \033[0m
    \033[38;5;250m  .-(    ).\033[0m
    \033[38;5;250m (__.__)___)\033[0m
    """
    heavy_rain = """
    \033[38;5;240;1m     .-.     \033[0m
    \033[38;5;240;1m    (   ).   \033[0m
    \033[38;5;240;1m   (___(__)  \033[0m
    \033[38;5;21;1m  ‚ʻ‚ʻ‚ʻ‚ʻ   \033[0m
    \033[38;5;21;1m  ‚ʻ‚ʻ‚ʻ‚ʻ   \033[0
    """
    hail = """
    \033[38;5;240;1m     .-.     \033[0m
    \033[38;5;240;1m    (   ).   \033[0m
    \033[38;5;240;1m   (___(__)  \033[0m
    \033[38;5;21;1m   o || || o   \033[0m
    \033[38;5;21;1m  ʻoʻ‚ʻoʻ‚ʻoʻ   \033[0
    """
    heavy_showers = """
    \033[38;5;226m _`/\"\"\033[38;5;240;1m.-.    \033[0m
    \033[38;5;226m  ,\\_\033[38;5;240;1m(   ).  \033[0m
    \033[38;5;226m   /\033[38;5;240;1m(___(__) \033[0m
    \033[38;5;21;1m   ‚ʻ‚ʻ‚ʻ‚ʻ  \033[0m
    \033[38;5;21;1m   ‚ʻ‚ʻ‚ʻ‚ʻ  \033[0m

    """
    snow_showers = """
    \033[38;5;226m _`/\"\"\033[38;5;240;1m.-.    \033[0m
    \033[38;5;226m  ,\\_\033[38;5;240;1m(   ).  \033[0m
    \033[38;5;226m   /\033[38;5;240;1m(___(__) \033[0m
    \033[38;5;255;1m    * * * *  \033[0m
    \033[38;5;255;1m   * * * *   \033[0m


    """
    light_rain = """
    \033[38;5;250m     .-.     \033[0m
    \033[38;5;250m    (   ).   \033[0m
    \033[38;5;250m   (___(__)  \033[0m
    \033[38;5;111m    ʻ ʻ ʻ ʻ  \033[0m
    \033[38;5;111m   ʻ ʻ ʻ ʻ   \033[0m
    """
    light_showers = """
    \033[38;5;226m _`/\"\"\033[38;5;250m.-.    \033[0m
    \033[38;5;226m  ,\\_\033[38;5;250m(   ).  \033[0m
    \033[38;5;226m   /\033[38;5;250m(___(__) \033[0m
    \033[38;5;111m     ʻ ʻ ʻ ʻ \033[0m
    \033[38;5;111m    ʻ ʻ ʻ ʻ  \033[0m
    """
    light_sleet = """
    \033[38;5;250m     .-.     \033[0m
    \033[38;5;250m    (   ).   \033[0m
    \033[38;5;250m   (___(__)  \033[0m
    \033[38;5;111m    ʻ \033[38;5;255m*\033[38;5;111m ʻ \033[38;5;255m*  \033[0m
    \033[38;5;255m   *\033[38;5;111m ʻ \033[38;5;255m*\033[38;5;111m ʻ   \033[0m
    """
    sleet_showers = """
    \033[38;5;226m _`/\"\"\033[38;5;250m.-.    \033[0m
    \033[38;5;226m  ,\\_\033[38;5;250m(   ).  \033[0m
    \033[38;5;226m   /\033[38;5;250m(___(__) \033[0m
    \033[38;5;111m     ʻ \033[38;5;255m*\033[38;5;111m ʻ \033[38;5;255m* \033[0m
    \033[38;5;255m    *\033[38;5;111m ʻ \033[38;5;255m*\033[38;5;111m ʻ  \033[0m
    """
    light_snow = """
    \033[38;5;250m     .-.     \033[0m
    \033[38;5;250m    (   ).   \033[0m
    \033[38;5;250m   (___(__)  \033[0m
    \033[38;5;255m    *  *  *  \033[0m
    \033[38;5;255m   *  *  *   \033[0m
    """
    light_snow_showers = """
    \033[38;5;226m _`/\"\"\033[38;5;250m.-.    \033[0m
    \033[38;5;226m  ,\\_\033[38;5;250m(   ).  \033[0m
    \033[38;5;226m   /\033[38;5;250m(___(__) \033[0m
    \033[38;5;255m     *  *  * \033[0m
    \033[38;5;255m    *  *  *  \033[0m
    """
    partly_cloud = """
    \033[38;5;226m   \\  /\033[0m
    \033[38;5;226m _ /\"\"\033[38;5;250m.-.    \033[0m
    \033[38;5;226m   \\_\033[38;5;250m(   ).  \033[0m
    \033[38;5;226m   /\033[38;5;250m(___(__) \033[0m
    """
    thunder_heavy_rain = """
    \033[38;5;240;1m     .-.     \033[0m
    \033[38;5;240;1m    (   ).   \033[0m
    \033[38;5;240;1m   (___(__)  \033[0m
    \033[38;5;21;1m  ‚ʻ\033[38;5;228;5m⚡\033[38;5;21;25mʻ‚\033[38;5;228;5m⚡\033[38;5;21;25m‚ʻ   \033[0m
    \033[38;5;21;1m  ‚ʻ‚ʻ\033[38;5;228;5m⚡\033[38;5;21;25mʻ‚ʻ   \033[0m
    """
    thunder_showers = """
    \033[38;5;226m _`/\"\"\033[38;5;250m.-.    \033[0m
    \033[38;5;226m  ,\\_\033[38;5;250m(   ).  \033[0m
    \033[38;5;226m   /\033[38;5;250m(___(__) \033[0m
    \033[38;5;228;5m    ⚡\033[38;5;111;25mʻ ʻ\033[38;5;228;5m⚡\033[38;5;111;25mʻ ʻ \033[0m
    \033[38;5;111m    ʻ ʻ ʻ ʻ  \033[0m
    """
    thunder_snow_showers = """
    \033[38;5;226m _`/\"\"\033[38;5;250m.-.    \033[0m
    \033[38;5;226m  ,\\_\033[38;5;250m(   ).  \033[0m
    \033[38;5;226m   /\033[38;5;250m(___(__) \033[0m
    \033[38;5;255m     *\033[38;5;228;5m⚡\033[38;5;255;25m *\033[38;5;228;5m⚡\033[38;5;255;25m * \033[0
    \033[38;5;255m    *  *  *  \033[0m
    """
    fog = """
    \033[38;5;251m _ -  _ - _ - \033[0m
    \033[38;5;251m  _ - _ - _  \033[0m
    \033[38;5;251m _ - _ - _ - \033[0m
    """
    sunny = """
    \033[38;5;226m    \\   /    \033[0m
    \033[38;5;226m     .-.     \033[0m
    \033[38;5;226m  ‒ (   ) ‒  \033[0m
    \033[38;5;226m     `-᾿     \033[0m
    \033[38;5;226m    /   \\    \033[0m
    """
    thunderstorm = """
    \033[38;5;255m    ⚡  ⚡  ⚡  \033[0m
    \033[38;5;255m     *\033[38;5;228;5m⚡\033[38;5;255;25m *\033[38;5;228;5m⚡\033[38;5;255;25m * \033[0
    \033[38;5;255m    ⚡  ⚡  ⚡  \033[0m
    \033[38;5;255m    ⚡  ⚡  ⚡  \033[0m
    """
    with CustomSwitch(value) as status:
        if status(WeatherType.thunderstorm):
            return thunderstorm
        if status(WeatherType.heavyRain):
            return thunder_heavy_rain
        if status(WeatherType.showers):
            return light_showers
        if status(WeatherType.lightCloud):
            return cloudy
        if status(WeatherType.lightRain):
            return light_rain
        if status(WeatherType.sleet):
            return light_sleet
        if status(WeatherType.clear):
            return sunny
        if status(WeatherType.hail):
            return hail
        if status(WeatherType.snow):
            return light_snow
